app/controllers/app_controller.rb

SELECT  "listings".* FROM "listings" WHERE "listings"."alive" = $1 ORDER BY "listings"."id" DESC LIMIT $2  [["alive", true], ["LIMIT", 6]]
---
  def index
    @new_listings = Listing.where(alive: true).last(6)