app/controllers/listing_controller.rb

  def show
    if params[:id]
      if Listing.where(id: params[:id]).count.zero?
        redirect_to show_path
        flash[:alert] = "Error finding id"
      else
        @listing = Listing.find(params[:id])
      end
    elsif params[:like]
      @listings = Listing.where('name LIKE ?', '%' + params[:like] + '%').where(alive: true).where(deleted: false)
      if @listings.count.zero?
---
SELECT COUNT(*) FROM "listings" WHERE "listings"."alive" = $1 AND "listings"."deleted" = $2  [["alive", true], ["deleted", false]]